Библиотека_электронных_документов_демо/src/Catalogs/НоменклатураПрисоединенныеФайлы/НоменклатураПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека_электронных_документов_демо/src/Catalogs/НоменклатураПрисоединенныеФайлы/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") Тогда
		
		НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ОтборПоВладельцу";
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВладелецФайла");
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = Параметры.Владелец;
		НовыйЭлемент.Использование = Истина;
		
		ВладелецФайла = Параметры.Владелец;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Оповестить("НоваяКартинка", Значение, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьФайл", ЭтотОбъект);
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = НСтр("ru = 'Выбор файла'");
	ВыборФайла.Фильтр = НСтр("ru = 'Все файлы (*.*)|*.*'");
	
	НачатьПомещениеФайлов(Оповещение, , ВыборФайла, , УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьФайл(АдресВременногоХранилищаФайла, ИмяФайла)
	
	СтруктураФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла);
	Файл = Справочники.НоменклатураПрисоединенныеФайлы.СоздатьЭлемент();
	Файл.Наименование = СтруктураФайла.Имя;
	Файл.ВладелецФайла = ВладелецФайла;
	Если Не ПустаяСтрока(АдресВременногоХранилищаФайла) Тогда
		ФайлХранилище = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
		Файл.ФайлХранилище = Новый ХранилищеЗначения(ФайлХранилище);
	КонецЕсли;
	
	Файл.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Количество() Тогда
		СоздатьФайл(Результат[0].Хранение, Результат[0].Имя);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
